trade_exp/src/Documents/ЗаказНаВнутреннееПотребление/ЗаказНаВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаказНаВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НеОтгружатьЧастями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="48b289e7-c87c-418e-a50f-41518ec9fa79">
    <name>ДавальческоеСырье</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="81d6ea61-b092-4e76-9e16-0e592aedcd5b">
    <name>НомерАкта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9d1a37b5-2af8-45d8-9862-a439f1a6ee9f">
    <name>ДатаАкта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cf36bf1f-e57f-41de-806d-e9785ff35393">
    <name>НомерДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7af05fe7-3abe-4213-97ce-12b2cb8a85fe">
    <name>ВидРаботСогласноДоговору</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2c16ea85-3bfc-47a9-bf09-8d3a10a62a04">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="764f2ce4-69b1-4b23-ba7b-61c1a4bd6469">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c79e41c6-36a3-439d-981c-102d63e2edaf">
    <name>ПотреблениеДляДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="831a6f91-045b-4862-950a-d0ee729101b7">
    <name>СтатусСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e9bb8a2d-64cd-4440-8e72-6713c53cb450">
    <name>ПозицияПоАкту</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КатегорияЭксплуатации</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ФизическоеЛицо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>350</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c9c9c763-d86b-4c75-9547-9bd36e961b14">
      <name>РасходРесурсовВНорме</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="3b60f560-37e1-452b-9c0f-5822117210ae">
      <name>РасходРесурсовПоФакту</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="63cbb9fc-319b-4ad9-b2ff-f7f5b8d2f982">
      <name>ЭкономияПерерасход</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e28186ed-243a-4c95-849d-1b6705b766b6">
      <name>Остаток</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4df546c5-9705-439e-a360-196e0e441e48">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="04dc74d1-4772-4a1a-b354-da25d675551f">
      <name>ВидРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c8042a00-99ef-4c64-8d5b-130da9d51b70">
      <name>Обособленно</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="55305b39-a0a6-4ee3-9b69-b921734ffa42">
      <name>НомерАкта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="2372e5fb-ecb8-4a5f-8c14-52b785e8d7ef">
      <name>ДатаАкта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e4113b0f-51c7-40ea-83bb-1e4c689a876d">
      <name>ПозицияПоАкту</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/ЗаказНаВнутреннееПотребление/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ДавальческоеСырьеВидимостьСвязанныхЭлементов(Объект.ДавальческоеСырье);
    Элементы.СтатусСогласования.Доступность = РольДоступна("СогласованиеИспользованияМатериалов") или РольДоступна("ПолныеПрава");
	ВидимостьКнопкиЗаполненияОстатками(Объект.Склад);
	Если Параметры.Свойство("ДокументОснование") Тогда
		Объект.ДокументОснование = Параметры.ДокументОснование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ДавальческоеСырьеПриИзмененииПосле(Элемент)
	ДавальческоеСырьеВидимостьСвязанныхЭлементов(Объект.ДавальческоеСырье);
КонецПроцедуры

&НаСервере
Процедура ДавальческоеСырьеВидимостьСвязанныхЭлементов(Видимость)
	Элементы.ТоварыВидРабот.Видимость = Видимость;
	Элементы.СтатусСогласования.Видимость = Видимость;
	Элементы.ТоварыГруппаРасходРесурсов.Видимость = Видимость;
КонецПроцедуры

#Область ЗаполнениеОстаткамиНаСкладе

&НаКлиенте
Процедура Док_ЗаполнитьОстаткамиНаСкладеПосле(Команда)
	
	Если НЕ ЭтоТорговыйСклад(Объект.Склад) Тогда
		ЗаполнитьОстаткамиПоСкладу(Объект.Склад);
	Конецесли 
	
КонецПроцедуры

&НаСервере
Функция ЭтоТорговыйСклад(ТекСклад)
	Возврат ТекСклад.СкладПродажи;
КонецФункции 

&НаКлиенте
Процедура Док_СкладПриИзмененииПосле(Элемент)
	ВидимостьКнопкиЗаполненияОстатками(Объект.Склад);
КонецПроцедуры

&НаСервере
Процедура ВидимостьКнопкиЗаполненияОстатками(Склад)
	
	Если Не Склад.Пустая() Тогда
    	Элементы.ТоварыЗаполнитьОстаткамиНаСкладе.Доступность = НЕ ЭтоТорговыйСклад(Склад)
	Иначе
		Элементы.ТоварыЗаполнитьОстаткамиНаСкладе.Доступность = Ложь
	Конецесли	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткамиПоСкладу(Склад)
	
	Результат = АльтерраОбщегоНазначения.ПолучитьОстаткиПоСкладу(Склад);
		
	Если Результат.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("На данном складе нет доступных остатков");
	Иначе
		Объект.Товары.Загрузить(Результат.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ТоварыНоменклатураПриИзмененииПосле(Элемент)
	СтрокаТовары = Элементы.Товары.ТекущиеДанные;
	СтрокаТовары.СтатьяРасходов = НайтиСтатьюРасходов();  
КонецПроцедуры

&НаСервере
Функция НайтиСтатьюРасходов() 
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РемонтИТехническоеОбслуживание") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
			|ИЗ
			|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
			|ГДЕ
			|	НоменклатураДополнительныеРеквизиты.Свойство.Наименование = ""Статья списания""
			|	И НоменклатураДополнительныеРеквизиты.Ссылка.Ссылка = &Ссылка";
		
		Техника = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументОснование, "Техника");	
		Запрос.УстановитьПараметр("Ссылка", Техника);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДополнительноеЗначение = Выборка.Значение;	
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ДополнительноеЗначение) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	СтатьиРасходов.Ссылка КАК Ссылка
				|ИЗ
				|	ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
				|ГДЕ
				|	СтатьиРасходов.Наименование = &Наименование";
			
			Запрос.УстановитьПараметр("Наименование", ДополнительноеЗначение.Наименование);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Возврат Выборка.Ссылка;	
			КонецЦикла; 
			
		КонецЕсли;	
	КонецЕсли;	

КонецФункции 

&НаКлиенте
Процедура Док_ИзменениеЭкономииОстатка(Элемент)
	СтрокаТовары = Элементы.Товары.ТекущиеДанные;
	СтрокаТовары.Остаток = СтрокаТовары.Количество - СтрокаТовары.РасходРесурсовПоФакту;
	СтрокаТовары.ЭкономияПерерасход = СтрокаТовары.РасходРесурсовВНорме - СтрокаТовары.РасходРесурсовПоФакту;		
КонецПроцедуры

#КонецОбласти
